zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/k2x/pinctrl/MK22FX512VLQ12-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_cfg_utils.py
 * for MK22FX512VLQ12/signal_configuration.xml
 *
 * Copyright 2023 Daniel DeGrasse
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MK24FN256VDC12-pinctrl.h with this part's differences applied
 * below (19 removed, 0 changed,
 * 82 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 29a4bf770d72f0ae
 */

#ifndef _ZEPHYR_DTS_BINDING_MK22FX512VLQ12_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MK22FX512VLQ12_WRAPPER_

#include "MK24FN256VDC12-pinctrl.h"

/* Signals not present on this part */
#undef FTM0_CH4_PTB12
#undef FTM0_CH5_PTB13
#undef FTM1_CH0_PTB12
#undef FTM1_CH1_PTB13
#undef FTM1_QD_PHA_PTB12
#undef FTM1_QD_PHB_PTB13
#undef FTM_CLKIN0_PTC12
#undef FTM_CLKIN1_PTC13
#undef I2C0_SCL_PTE24
#undef I2C0_SDA_PTE25
#undef PTB12
#undef PTB13
#undef SPI1_PCS0_PTD4
#undef SPI1_SCK_PTD5
#undef SPI1_SIN_PTD7
#undef SPI1_SOUT_PTD6
#undef UART3_CTS_b_PTB13
#undef UART3_RTS_b_PTB12
#undef USB_SOF_OUT_PTC0

/* Signals specific to this part */
#define ADC0_DM2_PTE3 KINETIS_MUX('E',3,0)
#define ADC0_DP2_PTE2 KINETIS_MUX('E',2,0)
#define ADC0_SE10_PTA7 KINETIS_MUX('A',7,0)
#define ADC0_SE11_PTA8 KINETIS_MUX('A',8,0)
#define ADC1_SE10_PTB4 KINETIS_MUX('B',4,0)
#define ADC1_SE11_PTB5 KINETIS_MUX('B',5,0)
#define CAN0_RX_PTA13 KINETIS_MUX('A',13,2)
#define CAN0_RX_PTB19 KINETIS_MUX('B',19,2)
#define CAN0_TX_PTA12 KINETIS_MUX('A',12,2)
#define CAN0_TX_PTB18 KINETIS_MUX('B',18,2)
#define CMP2_IN0_PTA12 KINETIS_MUX('A',12,0)
#define CMP2_IN1_PTA13 KINETIS_MUX('A',13,0)
#define CMP2_OUT_PTA5 KINETIS_MUX('A',5,5)
#define CMP2_OUT_PTB22 KINETIS_MUX('B',22,6)
#define FTM0_CH3_PTA6 KINETIS_MUX('A',6,3)
#define FTM0_CH4_PTA7 KINETIS_MUX('A',7,3)
#define FTM1_CH0_PTA8 KINETIS_MUX('A',8,3)
#define FTM1_CH1_PTA9 KINETIS_MUX('A',9,3)
#define FTM1_FLT0_PTB4 KINETIS_MUX('B',4,6)
#define FTM1_QD_PHA_PTA8 KINETIS_MUX('A',8,6)
#define FTM1_QD_PHB_PTA9 KINETIS_MUX('A',9,6)
#define FTM2_FLT0_PTB5 KINETIS_MUX('B',5,6)
#define FTM3_CH2_PTE7 KINETIS_MUX('E',7,6)
#define FTM3_CH3_PTE8 KINETIS_MUX('E',8,6)
#define FTM3_CH4_PTE9 KINETIS_MUX('E',9,6)
#define FTM3_CH5_PTE10 KINETIS_MUX('E',10,6)
#define FTM3_CH6_PTE11 KINETIS_MUX('E',11,6)
#define FTM3_CH7_PTE12 KINETIS_MUX('E',12,6)
#define I2S0_RXD0_PTE7 KINETIS_MUX('E',7,4)
#define I2S0_RXD1_PTE8 KINETIS_MUX('E',8,2)
#define I2S0_RX_BCLK_PTE9 KINETIS_MUX('E',9,4)
#define I2S0_RX_FS_PTE8 KINETIS_MUX('E',8,4)
#define I2S0_TXD0_PTE10 KINETIS_MUX('E',10,4)
#define I2S0_TXD1_PTE9 KINETIS_MUX('E',9,2)
#define I2S0_TX_BCLK_PTE12 KINETIS_MUX('E',12,4)
#define I2S0_TX_FS_PTE11 KINETIS_MUX('E',11,4)
#define PTA24 KINETIS_MUX('A',24,1)
#define PTA25 KINETIS_MUX('A',25,1)
#define PTA26 KINETIS_MUX('A',26,1)
#define PTA27 KINETIS_MUX('A',27,1)
#define PTA28 KINETIS_MUX('A',28,1)
#define PTA6 KINETIS_MUX('A',6,1)
#define PTA7 KINETIS_MUX('A',7,1)
#define PTA8 KINETIS_MUX('A',8,1)
#define PTA9 KINETIS_MUX('A',9,1)
#define PTB4 KINETIS_MUX('B',4,1)
#define PTB5 KINETIS_MUX('B',5,1)
#define PTE10 KINETIS_MUX('E',10,1)
#define PTE11 KINETIS_MUX('E',11,1)
#define PTE12 KINETIS_MUX('E',12,1)
#define PTE27 KINETIS_MUX('E',27,1)
#define PTE28 KINETIS_MUX('E',28,1)
#define PTE7 KINETIS_MUX('E',7,1)
#define PTE8 KINETIS_MUX('E',8,1)
#define PTE9 KINETIS_MUX('E',9,1)
#define SDHC0_CLKIN_PTD11 KINETIS_MUX('D',11,4)
#define SDHC0_CMD_PTE3 KINETIS_MUX('E',3,4)
#define SDHC0_D0_PTE1 KINETIS_MUX('E',1,4)
#define SDHC0_D1_PTE0 KINETIS_MUX('E',0,4)
#define SDHC0_D2_PTE5 KINETIS_MUX('E',5,4)
#define SDHC0_D3_PTE4 KINETIS_MUX('E',4,4)
#define SDHC0_D4_PTD12 KINETIS_MUX('D',12,4)
#define SDHC0_D5_PTD13 KINETIS_MUX('D',13,4)
#define SDHC0_D6_PTD14 KINETIS_MUX('D',14,4)
#define SDHC0_D7_PTD15 KINETIS_MUX('D',15,4)
#define SDHC0_DCLK_PTE2 KINETIS_MUX('E',2,4)
#define TRACE_CLKOUT_PTA6 KINETIS_MUX('A',6,7)
#define TRACE_CLKOUT_PTE0 KINETIS_MUX('E',0,5)
#define TRACE_D0_PTA10 KINETIS_MUX('A',10,7)
#define TRACE_D0_PTE4 KINETIS_MUX('E',4,5)
#define TRACE_D1_PTA9 KINETIS_MUX('A',9,7)
#define TRACE_D1_PTE3 KINETIS_MUX('E',3,5)
#define TRACE_D2_PTA8 KINETIS_MUX('A',8,7)
#define TRACE_D2_PTE2 KINETIS_MUX('E',2,5)
#define TRACE_D3_PTA7 KINETIS_MUX('A',7,7)
#define TRACE_D3_PTE1 KINETIS_MUX('E',1,5)
#define UART3_RTS_b_PTE7 KINETIS_MUX('E',7,3)
#define UART4_RTS_b_PTE27 KINETIS_MUX('E',27,3)
#define UART5_CTS_b_PTE10 KINETIS_MUX('E',10,3)
#define UART5_RTS_b_PTE11 KINETIS_MUX('E',11,3)
#define UART5_RX_PTE9 KINETIS_MUX('E',9,3)
#define UART5_TX_PTE8 KINETIS_MUX('E',8,3)

#endif /* _ZEPHYR_DTS_BINDING_MK22FX512VLQ12_WRAPPER_ */
